'''
ฟังก์ชัน Math
ฟังก์ชันบน Python มีใช้อย่างมากมายและหลากหลาย แต่ฟังก์ชันบางส่วนที่อาจได้ใช้งานไม่บ่อยนักสำหรับกรณีทั่วไป ก็จะถูกแยกออกไปไว้ในกลุ่ม Modules (โมดูล) ที่ต้องเรียกใช้แบบเจาะจง โดยในส่วนที่เกี่ยวข้องกับคณิตศาสตร์นั้น จะมีโมดูลที่ชื่อว่า math ซึ่งไม่ใช่องค์ประกอบพื้นฐานของภาษานี้ ดังนั้น เราต้องใช้คำสั่งเพื่ออ้างถึงโมดูลดังกล่าวและเรียกใช้งานในแบบ math.x() โดย x จะเป็นชื่อของฟังก์ชันเหล่านั้น

ดังนั้นโจทย์ข้อนี้จะมีฝึกใช้งาน Modules math จากโจทย์ทั้งหมดดังนี้

x1 = 1/2 +2πX
x2 = 1/4x + log4
x3 = √X + 3e**X
x4 = ln(2X) + ln(3X)
x5 = sin(X) + cos(X)
x6 = ⌊ X ⌋ + ⌈ X ⌉
x7 = X**2 + √X

หมายเหตุ:
ใช้ math.log10(x) แทน math.log(x, 10)
ใช้ math.exp(x) แทน math.pow(math.e, x)

ตัวอย่าง Input/Ouput

Enter X: 7.42
x1 =  47.12123497927253
x2 =  2.4570599913279625
x3 =  5009.824490928632
x4 =  5.800117583586633
x5 =  1.327785379386933
x6 =  15
x7 =  57.780367694375244

'''
import math

#input
x = float(input("Enter X: "))

#process
x1 = (1/2) + (2 * math.pi * x)
x2 = ((1/4)*x) + (math.log10(4))
x3 = (math.sqrt(x)) + (3 * (math.exp(x)))
x4 = math.log(2 * x) + (math.log(3 * x))
x5 = math.sin(x) + math.cos(x)
x6 = math.ceil(math.fabs(x) + math.fabs(x))
x7 = x**2 + (math.sqrt(x))
#output
print(f"x1 =  {x1}")
print(f"x2 =  {x2}")
print(f"x3 =  {x3}")
print(f"x4 =  {x4}")
print(f"x5 =  {x5}")
print(f"x6 =  {x6}")
print(f"x7 =  {x7}")
