'''
สร้างรหัสลับ
จงเขียนโปรแกรมรับจำนวนเต็มบวกมาสามจำนวน ได้แก่ a, b, และ c เพื่อมาใช้ในการสร้างรหัสลับโดยมีเงื่อนไขคือ

1.นำจำนวน a มาบวกกับจำนวน b แล้วต่อท้ายจำนวน c
2.นำจำนวนที่ได้จากข้อ 1. บวกกับจำนวน b แล้วต่อท้ายจำนวน a
3.นำจำนวนที่ได้จากข้อ 2. ต่อท้ายจำนวน b แล้วบวกด้วยจำนวน a

ข้อมูลเข้า
บรรทัดแรก รับจำนวนเต็มบวก a
บรรทัดสอง รับจำนวนเต็มบวก b
บรรทัดสอง รับจำนวนเต็มบวก c

ข้อมูลออก
บรรทัดแรก ตอบเป็นตัวเลขจำนวนเต็มที่เป็นรหัสลับที่ได้

'''

#input
a = int(input())
b = int(input())
c = int(input())

#solve
first = str(c) + str(a + b)
second = str(a) + str(int(first) + b)
third =  int(str(b) + str(second)) + int(a)

#output
print(int(third))