'''
แปลงอุณหภูมิ
สูตรในการเปลี่ยนค่าจากองศาเซลเซียสไปเป็นองศาฟาเรนไฮต์และเคลวิน

ให้อ่านข้อมูลอุณหภูมิ (หน่วยองศาเซลเซียส) จากนั้นคำนวณหาค่าองศาฟาเรนไฮต์และเคลวินด้วยสมการด้านบน เมื่อ C คือ องศาเซลเซียส F คือ องศาฟาเรนไฮต์ และ K คือ เคลวิน

ข้อมูลเข้า
หนึ่งบรรทัด ประกอบด้วย ค่าอุณหภูมิหน่วยองศาเซลเซียส เป็นจำนวนจริง

ข้อมูลออก
หนึ่งบรรทัด ประกอบด้วย ตัวเลขจำนวนจริงสองจำนวน คั่นด้วยเว้นวรรค จำนวนแรกคือ ค่าอุณหภูมิหน่วยองศาฟาเรนไฮต์ จำนวนที่สองคือ ค่าอุณหภูมิหน่วยเคลวิน
'''



#รับค่าอุณหภูมิองศาเซลเซียส
celsius = float(input())

#แปลงเป็นองศาฟาเรนไฮต์และเคลวิน
fahrenheit = (celsius * 1.8) + 32
kelvin = celsius + 273.15

#แสดงผลลัพธ์
print(fahrenheit , kelvin)
