'''
คะแนนสอบ
ให้นิสิตเขียนโปรแกรมรับจำนวนคะแนนสอบกลางภาค และปลายภาค ซึ่งแต่ละครั้งมีคะแนนเต็ม 60 คะแนน แล้วแสดงผลรวมและค่าเฉลี่ยของคะแนนสอบทั้งสองครั้ง

ข้อมูลเข้า
บรรทัดแรก รับจำนวนจริง midterm แทนคะแนนสอบกลางภาค โดย 0 <= midterm <= 60
บรรทัดที่สอง รับจำนวนจริง final แทนคะแนนสอบปลายภาค โดย 0 <= final <= 60

ข้อมูลออก
บรรทัดแรก แสดงข้อความ "Total: " ตามด้วยผลรวมของคะแนนสอบทั้งสองครั้ง
บรรทัดที่สอง แสดงข้อความ "Average: " ตามด้วยค่าเฉลี่ยของคะแนนสอบทั้งสองครั้ง (ไม่ต้องกังวลเรื่องการแสดงตำแหน่งทศนิยม)

'''

#รับค่า
midterm = float(input())
final = float(input())

#คำนวณ
total = midterm + final
average = (midterm + final)/2
        

#output
print(f"Total: {total}")
print(f"Average: {average}")
