'''
สามเหลี่ยม
จงเขียนโปรแกรมคำนวณพื้นที่สามเหลี่ยมที่ทราบความยาวด้านสองด้าน (a กับ b) และมุมระหว่างด้านสองด้านนั้น (C) จากสูตร

area = 1/2 absinC

ข้อมูลเข้า
บรรทัดแรกคือความยาวด้าน a (หน่วยเป็นเซนติเมตร)
บรรทัดที่สองคือความยาวด้าน b (หน่วยเป็นเซนติเมตร)
บรรทัดที่สามคือมุมระหว่างด้านทั้งสอง C (หน่วยเป็นองศา)

ข้อมูลส่งออก
พื้นที่ของสามเหลี่ยมทศนิยม 4 ตำแหน่ง (หน่วยเป็นตารางเซนติเมตร)

ตัวอย่าง Input/Output
10.0
10
90.0
Area = 50.0000 (sq cm)
ตัวอย่าง Input/Output

1e1
2e1
50.5
Area = 77.1625 (sq cm)

'''
import math

#input
a = float(input())
b = float(input())
c = float(input())

#process
area = ((1/2) * a * b) * math.sin(math.radians(c))

#output
print(f"Area = {area:.4f} (sq cm)")
